yoga416/CH32V307_SmartMedBox_FreeRTOS/User/app_task.c
                    if(lv_obj_is_valid(guider_ui.screen_4_label_20))
                        lv_label_set_text_fmt(guider_ui.screen_4_label_20, "Time: %02d:%02d", 
                            g_ui_data[g_current_active_user_id].meds_schedule[1].hour, g_ui_data[g_current_active_user_id].meds_schedule[1].min);
                    
                    if(lv_obj_is_valid(guider_ui.screen_4_label_23))
                        lv_label_set_text_fmt(guider_ui.screen_4_label_23, "Time: %02d:%02d", 
                            g_ui_data[g_current_active_user_id].meds_schedule[2].hour, g_ui_data[g_current_active_user_id].meds_schedule[2].min);


                    /* 3. 同步下拉框选中状态 */
                    if(lv_obj_is_valid(guider_ui.screen_4_ddlist_4)) {
                        uint16_t sel = (g_ui_data[g_current_active_user_id].meds_schedule[0].pill_count > 0) ? (g_ui_data[g_current_active_user_id].meds_schedule[0].pill_count - 1) : 0;
                        lv_dropdown_set_selected(guider_ui.screen_4_ddlist_4, sel);
                    }
                    if(lv_obj_is_valid(guider_ui.screen_4_ddlist_2)) {
                        uint16_t sel = (g_ui_data[g_current_active_user_id].meds_schedule[1].pill_count > 0) ? (g_ui_data[g_current_active_user_id].meds_schedule[1].pill_count - 1) : 0;
                        lv_dropdown_set_selected(guider_ui.screen_4_ddlist_2, sel);
                    }
                    if(lv_obj_is_valid(guider_ui.screen_4_ddlist_3)) {
                        uint16_t sel = (g_ui_data[g_current_active_user_id].meds_schedule[2].pill_count > 0) ? (g_ui_data[g_current_active_user_id].meds_schedule[2].pill_count - 1) : 0;
                        lv_dropdown_set_selected(guider_ui.screen_4_ddlist_3, sel);
                    }
                }

                /*检查是否到吃药时间刷新*/
                if(g_ui_data[g_current_active_user_id].update_flags & UI_FLAG_MED_STATUS) 
                {
                if(g_ui_data[g_current_active_user_id].screen_3_update_step==true)
                {
                // 5. 刷新吃药状态按钮 (控制 Screen 3 上的按键显示)
                if (lv_obj_is_valid(guider_ui.screen_3_btn_med1)) {
                    if (g_ui_data[g_current_active_user_id].med_status[0] == 1) { // 已经吃药
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med1_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med1_label, "已服");
                        lv_obj_add_state(guider_ui.screen_3_btn_med1, LV_STATE_DISABLED); // 禁用按钮
                    } else { // 未吃药
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med1_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med1_label, "吃药");
                        lv_obj_clear_state(guider_ui.screen_3_btn_med1, LV_STATE_DISABLED); // 解除禁用
                    }
                }
                
                if (lv_obj_is_valid(guider_ui.screen_3_btn_med2)) {
                    if (g_ui_data[g_current_active_user_id].med_status[1] == 1) {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med2_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med2_label, "已服");
                        lv_obj_add_state(guider_ui.screen_3_btn_med2, LV_STATE_DISABLED);
                    } else {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med2_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med2_label, "吃药");
                        lv_obj_clear_state(guider_ui.screen_3_btn_med2, LV_STATE_DISABLED);
                    }
                }

                if (lv_obj_is_valid(guider_ui.screen_3_btn_med3)) {
                    if (g_ui_data[g_current_active_user_id].med_status[2] == 1) {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med3_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med3_label, "已服");
                        lv_obj_add_state(guider_ui.screen_3_btn_med3, LV_STATE_DISABLED);
                    } else {
                        if (lv_obj_is_valid(guider_ui.screen_3_btn_med3_label)) 
                            lv_label_set_text(guider_ui.screen_3_btn_med3_label, "吃药");
                        lv_obj_clear_state(guider_ui.screen_3_btn_med3, LV_STATE_DISABLED);
                    }
                }
            }
            else if(g_ui_data[g_current_active_user_id].screen_3_update_step==false)
            {
                if (lv_obj_is_valid(guider_ui.screen_3_label_1)){
               lv_label_set_text(guider_ui.screen_3_label_1, "不在用药时间"); 
                }
            }
        }

           if(g_ui_data[g_current_active_user_id].update_flags & UI_FLAG_USER_STEP) 
                {
            if (guider_ui.screen_label_user != NULL) 
            {
                if (g_current_active_user_id == 0) {
                
                 lv_label_set_text(guider_ui.screen_label_user, "不");
            } else if (g_current_active_user_id == 1) {
                lv_label_set_text(guider_ui.screen_label_user, "用");
            } else if (g_current_active_user_id == 2) {
                lv_label_set_text(guider_ui.screen_label_user, "在");
                    }
            }
        }
                 // 刷新完成后，清除更新标志
                g_ui_data[g_current_active_user_id].update_flags = 0; 
                xSemaphoreGive(xGuiMutex);
            }
        }

        /*检查是否到吃药时间刷新*/
        /*每10秒检查一次*/
       // 每 10 秒无阻塞触发一次药盒检查
        if (xTaskGetTickCount() - last_check_mechine_time >= pdMS_TO_TICKS(10000)) {
            check_medication_time();
            last_check_mechine_time = xTaskGetTickCount(); // 更新上一次检查的时间
        }

        vTaskDelay(pdMS_TO_TICKS(5)); // 每5ms更新一次 LCD
    }   
}


void bsp_sensor_task(void *pvParameters)
{
    
    A7670C_Init();
    for(;;)
    {
        // 阻塞等待系统指令（语音触发）
        if (xQueueReceive(xSysCmdQueue, &received_cmd, portMAX_DELAY) == pdPASS)
        {
            switch (received_cmd)
            {
                case CMD_MEASURE_HR_SPO2:
                    APP_LOG("[App] Received CMD: Measure Heart Rate & SpO2\n");
                    if (g_max_handler_instance != NULL) {
                        max_event_t max_evt;
                        max_evt.event_type       = max_event_calc_hr_spo2;
                        max_evt.lifetime         = 500;
                        max_evt.sample_count     = MAX30102_DATA_NUM;
                        max_evt.pf_calc_callback = on_hr_spo2_calculated;
                        max30102_handler_send_event(g_max_handler_instance, &max_evt);
                    }
                    else {
                        printf("[App] MAX30102 Handler not ready!\n");
                    }
                    break;

                case CMD_MEASURE_BODY_TEMP:
                    APP_LOG("[App] Received CMD: Measure Body Temperature\n");
                    if (g_handler_instance != NULL) {
                        th_event_t mlx_evt;
                        mlx_evt.event_type = th_event_body_temp;
                        mlx_evt.lifetime = 500;
                        mlx_evt.pf_callback = MLX90614_Port_OnDataReady;
                        bsp_th_handler_t *h_mlx = (bsp_th_handler_t *)g_handler_instance;
                        h_mlx->os_handler_instance->pf_os_queue_put(h_mlx->event_queue_handler, &mlx_evt, 10);
                    }
                    break;

